app/controllers/info_controller.rb

  def who_bought
    @product = Product.find(params[:id])
    @orders = @product.orders
---
SELECT * FROM "orders" WHERE ("orders"."id" = 82955723)