app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    @product.price *= 100

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('http://example.com/foo.gif', '2009-02-15 21:37:11', 'awesome product', 100, 'awesome product description', '2009-02-15 21:37:11')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)
UPDATE "products" SET "title" = 'mega awesome title', "updated_at" = '2009-02-15 21:37:12' WHERE "id" = 953125641

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)
DELETE FROM "products" WHERE "id" = 953125641