app/controllers/store_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 10)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(3, '2009-02-18 05:39:21', 9990, 10, 10, '2009-02-18 05:39:21')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Nitin', '2009-02-18 05:39:21', 'check', 'dslkl', 'klkl', '2009-02-18 05:39:21')