app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('nitin', '379248200.600323686310412', '2009-02-14 19:04:07', '6cd6407d98db1b5bfa23c9931599eef2aa734407', '2009-02-14 19:04:07')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def destroy
    @user = User.find(params[:id])

    begin
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
DELETE FROM "users" WHERE "id" = 8